P8/evidence/k6-result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: J:/2S-2026/SA/Practicas-SA-B-202003948/P8/tests/k6/k6-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m40s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 1m10s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m00.7s/1m10.0s

running (0m02.0s), 01/10 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  0m01.7s/1m10.0s

running (0m03.0s), 02/10 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  0m02.7s/1m10.0s

running (0m04.0s), 02/10 VUs, 4 complete and 0 interrupted iterations
default   [   5% ] 02/10 VUs  0m03.7s/1m10.0s

running (0m05.0s), 03/10 VUs, 6 complete and 0 interrupted iterations
default   [   7% ] 03/10 VUs  0m04.7s/1m10.0s

running (0m06.0s), 03/10 VUs, 8 complete and 0 interrupted iterations
default   [   8% ] 03/10 VUs  0m05.7s/1m10.0s

running (0m07.0s), 04/10 VUs, 9 complete and 0 interrupted iterations
default   [  10% ] 04/10 VUs  0m06.7s/1m10.0s

running (0m08.0s), 04/10 VUs, 12 complete and 0 interrupted iterations
default   [  11% ] 04/10 VUs  0m07.7s/1m10.0s

running (0m09.0s), 04/10 VUs, 16 complete and 0 interrupted iterations
default   [  12% ] 04/10 VUs  0m08.7s/1m10.0s

running (0m10.0s), 05/10 VUs, 20 complete and 0 interrupted iterations
default   [  14% ] 05/10 VUs  0m09.7s/1m10.0s

running (0m11.0s), 05/10 VUs, 25 complete and 0 interrupted iterations
default   [  15% ] 05/10 VUs  0m10.7s/1m10.0s

running (0m12.0s), 06/10 VUs, 30 complete and 0 interrupted iterations
default   [  17% ] 06/10 VUs  0m11.7s/1m10.0s

running (0m13.0s), 06/10 VUs, 36 complete and 0 interrupted iterations
default   [  18% ] 06/10 VUs  0m12.7s/1m10.0s

running (0m14.0s), 07/10 VUs, 42 complete and 0 interrupted iterations
default   [  20% ] 07/10 VUs  0m13.7s/1m10.0s

running (0m15.0s), 07/10 VUs, 48 complete and 0 interrupted iterations
default   [  21% ] 07/10 VUs  0m14.7s/1m10.0s

running (0m16.0s), 08/10 VUs, 54 complete and 0 interrupted iterations
default   [  22% ] 08/10 VUs  0m15.7s/1m10.0s

running (0m17.0s), 08/10 VUs, 60 complete and 0 interrupted iterations
default   [  24% ] 08/10 VUs  0m16.7s/1m10.0s

running (0m18.0s), 08/10 VUs, 65 complete and 0 interrupted iterations
default   [  25% ] 08/10 VUs  0m17.7s/1m10.0s

running (0m19.0s), 09/10 VUs, 72 complete and 0 interrupted iterations
default   [  27% ] 09/10 VUs  0m18.7s/1m10.0s

running (0m20.0s), 09/10 VUs, 81 complete and 0 interrupted iterations
default   [  28% ] 09/10 VUs  0m19.7s/1m10.0s

running (0m21.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  0m20.7s/1m10.0s

running (0m22.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  31% ] 10/10 VUs  0m21.7s/1m10.0s

running (0m23.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  0m22.7s/1m10.0s

running (0m24.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  0m23.7s/1m10.0s

running (0m25.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  0m24.7s/1m10.0s

running (0m26.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  0m25.7s/1m10.0s

running (0m27.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  0m26.7s/1m10.0s

running (0m28.0s), 10/10 VUs, 159 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  0m27.7s/1m10.0s

running (0m29.0s), 10/10 VUs, 166 complete and 0 interrupted iterations
default   [  41% ] 10/10 VUs  0m28.7s/1m10.0s

running (0m30.0s), 10/10 VUs, 173 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  0m29.7s/1m10.0s

running (0m31.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  0m30.7s/1m10.0s

running (0m32.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  0m31.7s/1m10.0s

running (0m33.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  0m32.7s/1m10.0s

running (0m34.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  0m33.7s/1m10.0s

running (0m35.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  0m34.7s/1m10.0s

running (0m36.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  51% ] 10/10 VUs  0m35.7s/1m10.0s

running (0m37.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  0m36.7s/1m10.0s

running (0m38.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  0m37.7s/1m10.0s

running (0m39.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  0m38.7s/1m10.0s

running (0m40.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  0m39.7s/1m10.0s

running (0m41.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  0m40.7s/1m10.0s

running (0m42.0s), 10/10 VUs, 289 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  0m41.7s/1m10.0s

running (0m43.0s), 10/10 VUs, 296 complete and 0 interrupted iterations
default   [  61% ] 10/10 VUs  0m42.7s/1m10.0s

running (0m44.0s), 10/10 VUs, 303 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  0m43.7s/1m10.0s

running (0m45.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  0m44.7s/1m10.0s

running (0m46.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  0m45.7s/1m10.0s

running (0m47.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  0m46.7s/1m10.0s

running (0m48.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  0m47.7s/1m10.0s

running (0m49.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  0m48.7s/1m10.0s

running (0m50.0s), 10/10 VUs, 360 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  0m49.7s/1m10.0s

running (0m51.0s), 10/10 VUs, 370 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  0m50.7s/1m10.0s

running (0m52.0s), 10/10 VUs, 380 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  0m51.7s/1m10.0s

running (0m53.0s), 10/10 VUs, 390 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  0m52.7s/1m10.0s

running (0m54.0s), 10/10 VUs, 396 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  0m53.7s/1m10.0s

running (0m55.0s), 10/10 VUs, 404 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  0m54.7s/1m10.0s

running (0m56.0s), 10/10 VUs, 412 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  0m55.7s/1m10.0s

running (0m57.0s), 10/10 VUs, 420 complete and 0 interrupted iterations
default   [  81% ] 10/10 VUs  0m56.7s/1m10.0s

running (0m58.0s), 10/10 VUs, 430 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  0m57.7s/1m10.0s

running (0m59.0s), 10/10 VUs, 440 complete and 0 interrupted iterations
default   [  84% ] 10/10 VUs  0m58.7s/1m10.0s

running (1m00.0s), 10/10 VUs, 450 complete and 0 interrupted iterations
default   [  85% ] 10/10 VUs  0m59.7s/1m10.0s

running (1m01.0s), 10/10 VUs, 460 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  1m00.7s/1m10.0s

running (1m02.0s), 09/10 VUs, 470 complete and 0 interrupted iterations
default   [  88% ] 09/10 VUs  1m01.7s/1m10.0s

running (1m03.0s), 08/10 VUs, 479 complete and 0 interrupted iterations
default   [  90% ] 08/10 VUs  1m02.7s/1m10.0s

running (1m04.0s), 07/10 VUs, 487 complete and 0 interrupted iterations
default   [  91% ] 07/10 VUs  1m03.7s/1m10.0s

running (1m05.0s), 06/10 VUs, 494 complete and 0 interrupted iterations
default   [  92% ] 06/10 VUs  1m04.7s/1m10.0s

running (1m06.0s), 05/10 VUs, 500 complete and 0 interrupted iterations
default   [  94% ] 05/10 VUs  1m05.7s/1m10.0s

running (1m07.0s), 04/10 VUs, 504 complete and 0 interrupted iterations
default   [  95% ] 04/10 VUs  1m06.7s/1m10.0s

running (1m08.0s), 03/10 VUs, 508 complete and 0 interrupted iterations
default   [  97% ] 03/10 VUs  1m07.7s/1m10.0s

running (1m09.0s), 03/10 VUs, 510 complete and 0 interrupted iterations
default   [  98% ] 03/10 VUs  1m08.7s/1m10.0s

running (1m10.0s), 02/10 VUs, 512 complete and 0 interrupted iterations
default   [ 100% ] 02/10 VUs  1m09.7s/1m10.0s

running (1m11.0s), 01/10 VUs, 514 complete and 0 interrupted iterations
default ↓ [ 100% ] 01/10 VUs  1m10s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=156.06ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1030    14.485435/s
    checks_succeeded...: 100.00% 1030 out of 1030
    checks_failed......: 0.00%   0 out of 1030

    ✓ status 200
    ✓ cuerpo ok

    HTTP
    http_req_duration..............: avg=87.14ms min=71.42ms med=77.32ms max=342.04ms p(90)=98.8ms p(95)=156.06ms
      { expected_response:true }...: avg=87.14ms min=71.42ms med=77.32ms max=342.04ms p(90)=98.8ms p(95)=156.06ms
    http_req_failed................: 0.00%  0 out of 516
    http_reqs......................: 516    7.256781/s

    EXECUTION
    iteration_duration.............: avg=1.08s   min=1.07s   med=1.07s   max=1.34s    p(90)=1.1s   p(95)=1.15s   
    iterations.....................: 515    7.242717/s
    vus............................: 1      min=1        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 141 kB 2.0 kB/s
    data_sent......................: 40 kB  559 B/s



running (1m11.1s), 00/10 VUs, 515 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  1m10s